Tekla Open API Reference for Tekla Structures 2025
ReferenceModelObjectAttributeEnumerator.Current Property
 The current attribute.
 Namespace: Tekla.Structures.Model.Collaboration
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Object Current { get; }
Public ReadOnly Property Current As Object
	Get
Property Value
Type: Object
Implements
IEnumerator.Current
See Also
Reference
ReferenceModelObjectAttributeEnumerator Class
Tekla.Structures.Model.Collaboration Namespace